[{"name": "\n      Chocolate Pecan Pie\n    ", "tags": [{"name": "Chocolate"}, {"name": "Pecan"}], "preparation_time": "Yield8 servings", "description": "Here is a pie that might make Thanksgiving purists shake their heads. Chocolate and pecan? But bear with us. The bittersweet chocolate adds depth to what is traditionally an achingly sweet pie, and the bourbon gives it a grownup finish. For detailed instructions on pie crust, check out our pie guide.", "ingredients": [{"comment": " (150 grams), plus more for dusting", "name": "all-purpose flour", "unit": "cups ", "quantity": "1 ¼"}, {"comment": "", "name": "fine sea salt", "unit": "teaspoon ", "quantity": "¼"}, {"comment": ", preferably high-fat, European style, chilled and cubed", "name": "unsalted butter", "unit": "tablespoons ", "quantity": "10"}, {"comment": ", as needed", "name": "ice water", "unit": "tablespoons ", "quantity": "2 to 4"}, {"comment": " (170 grams)", "name": "pecan halves", "unit": "cups ", "quantity": "1 ½"}, {"comment": "", "name": "unsalted butter", "unit": "tablespoons ", "quantity": "6"}, {"comment": ", chopped (56 grams)", "name": "bittersweet chocolate", "unit": "ounces ", "quantity": "2"}, {"comment": "", "name": "dark corn syrup", "unit": "cup ", "quantity": "¾"}, {"comment": "", "name": "eggs", "unit": "large ", "quantity": "4"}, {"comment": " (100 grams)", "name": "light brown sugar", "unit": "cup packed ", "quantity": "½"}, {"comment": " (5 grams)", "name": "unsweetened cocoa powder", "unit": "tablespoon ", "quantity": "1"}, {"comment": "", "name": "bourbon", "unit": "tablespoons ", "quantity": "2"}, {"comment": "", "name": "fine sea salt", "unit": "teaspoon ", "quantity": "¼"}], "yield": "8 servings", "steps": [{"number": 1, "instructions": "Make the crust: In a food processor, pulse together the flour and salt. Add butter and pulse until the mixture forms chickpea-size pieces. Add ice water, 1 tablespoon at a time, and pulse until the dough just comes together. It should be moist but not wet. On a lightly floured surface, gather the dough into a ball. Flatten into a disk with the heel of your hand. Cover tightly with plastic wrap and refrigerate for at least 1 hour and up to 2 days."}, {"number": 2, "instructions": "On a lightly floured surface, after removing plastic wrap, roll out dough to a 12-inch circle. Transfer crust to a 9-inch pie plate. Fold over any excess dough, then crimp edges. Prick crust all over with a fork. Chill crust for 30 minutes."}, {"number": 3, "instructions": "While the dough chills, heat the oven to 375 degrees. Line chilled crust with aluminum foil and fill with pie weights or dried beans. Bake for 25 minutes. Remove foil and bake until very pale golden, 5 to 10 minutes longer."}, {"number": 4, "instructions": "Reduce oven temperature to 350 degrees. Spread pecans on a rimmed baking sheet. Toast nuts, shaking pan occasionally, until fragrant, 8 to 10 minutes. Cool."}, {"number": 5, "instructions": "Make the filling: In a small saucepan over low heat, melt butter and chopped chocolate, stirring until smooth; cool."}, {"number": 6, "instructions": "In a large bowl, whisk together cooled chocolate-butter mixture, corn syrup, eggs, sugar, cocoa powder, bourbon and salt. Pour the mixture into the prepared crust. Arrange pecans over filling. Transfer to a large rimmed baking sheet. Bake until the filling is just set when the pan is jiggled, 30 to 40 minutes. Remove pie from the oven and cool completely on a wire rack before serving."}], "photo_url": "http://graphics8.nytimes.com/images/2013/11/19/dining/chocolatepecanpie/chocolatepecanpie-articleLarge.jpg"}, {"name": "\n      Cranberry-Orange Jelly\n    ", "tags": [{"name": "Vegan"}, {"name": "Vegetarian"}, {"name": "Cranberry"}, {"name": "American"}], "preparation_time": "Yield12 to 16 servings", "description": "This is the cranberry sauce for cooks who secretly (or not so secretly) like the kind that comes in a can, a quivering ruby mass with an unexpected dash of orange and spice. Guests can scoop it out of a pretty glass bowl, but it’s more fun to unmold it onto a cake plate and serve it in slices. Make sure the water your use to unmold your jelly is quite hot, not just warm. The idea is to melt the outer jelly layer just enough so that the whole mold can slip right out.", "ingredients": [{"comment": " (see note)", "name": "Lillet", "unit": "cups ", "quantity": "1 ½"}, {"comment": ", like Grand Marnier", "name": "orange liqueur", "unit": "cup ", "quantity": "½"}, {"comment": "", "name": "sugar", "unit": "cups ", "quantity": "2"}, {"comment": " (optional)", "name": "juniper berries", "unit": "tablespoons ", "quantity": "2"}, {"comment": " (about 8 cups; frozen can be substituted)", "name": "cranberries", "unit": "12-ounce bags fresh or frozen ", "quantity": "2"}, {"comment": " (if chilling in a mold)", "name": "Nonstick cooking spray", "unit": "", "quantity": ""}], "yield": "12 to 16 servings", "steps": [{"number": 1, "instructions": "In a heavy saucepan, combine Lillet, liqueur, sugar and juniper berries if using. Bring to a boil over medium-high heat. Add cranberries and return to a boil. Reduce the heat to low and simmer until all the cranberries burst and are very soft, at least 10 minutes total (or use a candy thermometer and cook mixture to 210 to 215 degrees). The mixture should be reduced and thickened, like a very loose jam."}, {"number": 2, "instructions": "Strain the sauce into a bowl through a sieve, pushing on the solids with a rubber spatula to extract all the liquid. Discard the solids. Stir the liquid and transfer to a pretty serving bowl or a mold. (If using a mold, spray the insides first with nonstick cooking spray.) A funnel or liquid measuring cup with a spout can be useful for transferring without splashing the sides. Cover and refrigerate for at least three hours, or up to several days. Keep refrigerated until ready to serve."}, {"number": 3, "instructions": "If you chilled the jelly in a mold, turn it out by placing the mold in a large bowl. Carefully pour hot water into the bowl so it comes up the sides of the mold, melting the jelly just enough to release it from the mold. After 3 minutes, try unmolding the jelly onto a serving dish. If it doesn’t come out, return to the bowl and try again 2 minutes later. Repeat until the jelly is released. If necessary, return it to the refrigerator to firm up before serving."}], "photo_url": "http://graphics8.nytimes.com/images/2015/10/27/dining/27COOKING-CRANORGJELLY2/27COOKING-CRANORGJELLY2-articleLarge.jpg"}, {"name": "\n      Spicy Red Pepper Cranberry Relish\n    ", "tags": [{"name": "Gluten Free"}, {"name": "Vegan"}, {"name": "Vegetarian"}, {"name": "Cranberry"}, {"name": "Jalapeno"}, {"name": "American"}], "preparation_time": "30 minutes", "description": "A kicky condiment, usually made with cranberries, can offset the neutral (read: bland) yet rich nature of the Thanksgiving meal. This hot red-pepper cranberry relish with jalapeños and cayenne fits the bill. You can keep the seasoning somewhat tame, or ramp up the heat to taste. It will keep for 2 weeks or so; make it in advance, as soon as cranberries are available, and have it on hand in the fridge through the holiday season.", "ingredients": [{"comment": "", "name": "sugar", "unit": "cup ", "quantity": "1"}, {"comment": ", preferably red, seeded and finely diced", "name": "jalapeños", "unit": "large ", "quantity": "2"}, {"comment": "", "name": "lemon juice", "unit": "tablespoon ", "quantity": "1"}, {"comment": "", "name": "salt", "unit": "teaspoon ", "quantity": "½"}, {"comment": "", "name": "cayenne", "unit": "teaspoon ", "quantity": "¼"}, {"comment": "", "name": "ginger", "unit": "tablespoon grated ", "quantity": "1"}, {"comment": "", "name": "cranberries", "unit": "ounces ", "quantity": "12"}], "yield": "About 2 cups", "steps": [{"number": 1, "instructions": "Put sugar, jalapeños, lemon juice, salt and cayenne in a heavy-bottomed saucepan over medium-high heat. Add 1/2 cup water, then stir with a wooden spoon to dissolve sugar, and simmer 2 minutes."}, {"number": 2, "instructions": "Add ginger and cranberries, and bring to a boil. Reduce heat to medium and let mixture cook, stirring occasionally, until cranberries have softened and no liquid remains in pan, about 15 minutes."}, {"number": 3, "instructions": "Let cool and taste. Add more cayenne or jalapeños if desired. It can be stored in the refrigerator for up to 2 weeks."}], "photo_url": "http://graphics8.nytimes.com/images/2013/11/08/dining/08spicyredpeppercranberry/08spicyredpeppercranberry-articleLarge.jpg"}, {"name": "\n      Caramelized Corn With Fresh Mint\n    ", "tags": [{"name": "Gluten Free"}, {"name": "Vegetarian"}, {"name": "Corn"}], "preparation_time": "30 minutes", "description": "This is an invincible weapon in the culinary arsenal: whole corn kernels, simply tossed in a hot skillet of melted butter, and showered with fresh mint when they start to pop and turn brown. It's sweet and savory all at once. And it's divine.", "ingredients": [{"comment": ", white or yellow (from about 12 cobs), or two 16-ounce bags frozen white corn", "name": "corn kernels", "unit": "cups fresh ", "quantity": "4 to 5"}, {"comment": "", "name": "unsalted butter", "unit": "stick (4 ounces) ", "quantity": "1"}, {"comment": "", "name": "mint", "unit": "cup chopped fresh ", "quantity": "½"}, {"comment": "", "name": "Salt", "unit": "", "quantity": ""}], "yield": "10 to 12 servings", "steps": [{"number": 1, "instructions": "If using frozen corn, drain between layers of paper towels until thawed, about 30 minutes."}, {"number": 2, "instructions": "In a wide skillet, melt half the butter over high heat. Add half the corn and cook, stirring often, until golden and browned (kernels may begin to pop), about 10 minutes. Stir in half the mint and sprinkle with salt. Transfer to a serving bowl. Repeat with remaining corn, butter, mint and salt."}], "photo_url": "http://graphics8.nytimes.com/images/2015/11/02/dining/02COOKING-CARAMALIZEDCORN2/02COOKING-CARAMALIZEDCORN2-articleLarge.jpg"}, {"name": "\n      Apple Cranberry Slab Pie\n    ", "tags": [{"name": "American"}], "preparation_time": "Yield18 to 24 servings", "description": "A slab pie is nothing more than a regular pie writ large. Baked in a 9-x-13-inch pan, this pie feeds 24 but is easier to make (and to carry) than 3 separate pies. The filling was inspired by an e-mail from Pete Wells, our restaurant critic, who mused about his ideal Thanksgiving dessert; the brown sugar, ginger and rum give it a complex and more autumnal flavor than most apple pies. Serve with whipped crème fraiche and small glasses of good, aged rum. (Don't let making your own pie crust intimidate you: our pie guide has everything you need to know.)", "ingredients": [{"comment": " (450 grams)", "name": "all-purpose flour", "unit": "cups ", "quantity": "3 ¾"}, {"comment": " (6 grams)", "name": "fine sea salt", "unit": "teaspoon ", "quantity": "1"}, {"comment": ", preferably a high-fat, European-style butter, chilled and cut into 1/2-inch pieces (15 ounces/425 grams)", "name": "butter", "unit": "sticks plus 6 tablespoons ", "quantity": "3"}, {"comment": ", more as needed", "name": "ice water", "unit": "tablespoons ", "quantity": "6 to 8"}, {"comment": ", preferably a mixture of Gala, Golden Delicious and Granny Smith, peeled, cored and sliced 1/4-inch thick (21 cups/about 3 kilograms)", "name": "apples", "unit": "pounds ", "quantity": "6 ¾"}, {"comment": " (300 grams)", "name": "light brown sugar", "unit": "packed cups ", "quantity": "1 ½"}, {"comment": "", "name": "maple syrup", "unit": "cup ", "quantity": "¾"}, {"comment": " (150 grams)", "name": "dried cranberries", "unit": "cup ", "quantity": "1"}, {"comment": " (75 grams)", "name": "instant tapioca", "unit": "tablespoons ", "quantity": "6"}, {"comment": "", "name": "dark rum", "unit": "tablespoons ", "quantity": "3"}, {"comment": " (3 grams)", "name": "lemon zest", "unit": "teaspoons finely grated ", "quantity": "1 ½"}, {"comment": "", "name": "lemon juice", "unit": "tablespoons ", "quantity": "2"}, {"comment": " (18 grams)", "name": "grated fresh ginger", "unit": "tablespoon ", "quantity": "1"}, {"comment": " (9 grams)", "name": "fine sea salt", "unit": "teaspoons ", "quantity": "1 ¼"}, {"comment": " (6 grams)", "name": "ground cinnamon", "unit": "teaspoons ", "quantity": "2 ¼"}, {"comment": "", "name": "grated nutmeg", "unit": "teaspoon ", "quantity": "¾"}, {"comment": ", diced small (1 ounce/28 grams)", "name": "unsalted butter", "unit": "tablespoons ", "quantity": "2"}, {"comment": ", lightly beaten", "name": "egg", "unit": "large ", "quantity": "1"}, {"comment": "", "name": "heavy cream", "unit": "tablespoon ", "quantity": "1"}, {"comment": " (20 grams)", "name": "Demerara sugar", "unit": "tablespoons ", "quantity": "1 ½"}], "yield": "18 to 24 servings", "steps": [{"number": 1, "instructions": "Make the crust: In a food processor, briefly pulse together flour and salt. Add butter and pulse until mixture forms chickpea-size pieces. Add ice water, 1 tablespoon at a time, and pulse until mixture is just moist enough to hold together. Form dough into two balls, one about 2/3 of dough and the other the remaining 1/3 of dough. Wrap each with plastic and flatten into disks. Refrigerate at least 1 hour and up to 2 days before rolling out and baking."}, {"number": 2, "instructions": "Lightly flour a work surface and remove the plastic wrap from the larger dough ball. Using a lightly floured rolling pin, roll out the dough ball to a 12-by-16-inch rectangle, dusting with flour if dough sticks. (Leave smaller dough ball in the fridge.) Transfer rolled-out dough to a 9-by-13-inch baking dish. Carefully line the pan with dough, pressing it into bottom of pan and completely up the sides. Crimp the top edges. Chill dough in fridge until ready to fill."}, {"number": 3, "instructions": "Roll out remaining dough ball to a 10-by-13-inch rectangle, dusting with flour if dough is sticking. Using a decorative cookie cutter (like apples, leaves or hearts), cut out dough shapes. Reroll scraps if necessary to use up as much dough as possible. Transfer cutouts to a small baking sheet. Return baking pan and sheet to refrigerator to chill while you prepare filling."}, {"number": 4, "instructions": "Heat oven to 425 degrees. Arrange a wire rack in the lowest position in the oven. Place a large rimmed baking sheet on the floor of the oven to preheat."}, {"number": 5, "instructions": "Make the filling: In a large bowl, combine apples, sugar, maple syrup, cranberries, tapioca, rum, lemon zest and juice, ginger, salt, cinnamon and nutmeg. Let mixture stand 10 minutes. Pour filling into bottom pie crust and dot with 2 tablespoons diced butter. Arrange dough cutouts on top of apple mixture, overlapping it slightly and making sure several cutout edges touch sides of pan. Whisk together egg and cream. Brush over crust; sprinkle with Demerara sugar."}, {"number": 6, "instructions": "Move rimmed baking sheet from oven floor to lowest rack. Place pie pan on baking sheet and bake for 20 minutes. Reduce oven temperature to 375 degrees. Continue baking until crust is golden brown and juices are bubbling thickly, 40 to 60 minutes longer. Loosely tent top of pie with foil if crust browns before filling is ready. Transfer pie to a wire rack to cool completely before serving."}], "photo_url": "http://graphics8.nytimes.com/images/2014/11/04/dining/apple-cranberry-slab-pie/apple-cranberry-slab-pie-articleLarge.jpg"}, {"name": "\n      Fiery Sweet Potatoes\n    ", "tags": [{"name": "Gluten Free"}, {"name": "Vegetarian"}, {"name": "Coconut Milk"}, {"name": "Curry Paste"}, {"name": "Sweet Potato"}], "preparation_time": "2 hours", "description": "Coconut milk and fiery Thai spice paste turn up the heat, but the familiar brown sugar and butter are still part of the mix in this amazing and unexpected combination of flavors that would be a fine addition to any table from Thanksgiving through May.", "ingredients": [{"comment": "", "name": "sweet potatoes", "unit": "pounds ", "quantity": "5"}, {"comment": "", "name": "coconut milk", "unit": "cup canned ", "quantity": "1"}, {"comment": "", "name": "Thai red curry paste", "unit": "tablespoon ", "quantity": "1"}, {"comment": "", "name": "dark brown sugar", "unit": "cup ", "quantity": "½"}, {"comment": "", "name": "unsalted butter", "unit": "tablespoons ", "quantity": "4"}, {"comment": "", "name": "salt", "unit": "teaspoon ", "quantity": "1"}], "yield": "10 to 12 servings", "steps": [{"number": 1, "instructions": "Heat oven to 375 degrees. Bake potatoes on sheet pan until very soft, about 75 minutes. When cool enough to handle, peel and mash."}, {"number": 2, "instructions": "In a small saucepan, heat coconut milk with curry paste over low heat. Mix coconut milk mixture, half the sugar, half the butter and salt into potatoes. Keep warm until ready to serve, or cover and refrigerate up to two days."}, {"number": 3, "instructions": "At least 30 minutes before serving, heat oven to 425 degrees. Put potatoes in a baking dish, cover with foil and bake 20 minutes. Uncover, dot with remaining butter and sugar and broil until brown and crusty, checking often to prevent scorching."}], "photo_url": "http://graphics8.nytimes.com/images/2015/10/26/dining/26COOKING-FIERYSWEETPOTATOES1/26COOKING-FIERYSWEETPOTATOES1-articleLarge.jpg"}, {"name": "\n      Lemon-Garlic Kale Salad\n    ", "tags": [{"name": "Kale"}], "preparation_time": "About 25 minutes", "description": "Here's a snappy, fresh side dish or a light supper: a lemony green salad, rich with tang and crunch. The dressing is nothing more than lemon juice, olive oil, garlic and salt. Its simplicity makes it perfect.", "ingredients": [{"comment": "", "name": "sliced almonds", "unit": "cups ", "quantity": "2"}, {"comment": " (from 2 to 4 lemons)", "name": "lemon juice", "unit": "cup freshly squeezed ", "quantity": "⅓"}, {"comment": "", "name": "Kosher salt", "unit": "", "quantity": ""}, {"comment": "", "name": "extra-virgin olive oil", "unit": "cups ", "quantity": "1 ½"}, {"comment": ", crushed with the flat side of a knife, peeled and left whole", "name": "garlic", "unit": "cloves ", "quantity": "4"}, {"comment": ", thick stems removed (if using prewashed trimmed kale, buy 4 clamshell containers)", "name": "kale leaves", "unit": "ounces washed and dried ", "quantity": "10 to 12"}, {"comment": " (optional)", "name": "freshly grated Parmesan", "unit": "cups ", "quantity": "1 ½"}], "yield": "8 to 12 servings", "steps": [{"number": 1, "instructions": "In a toaster oven or skillet, toast almonds until golden brown and fragrant. Set aside to cool."}, {"number": 2, "instructions": "In a bowl, combine lemon juice and 1 heaping teaspoon salt. Slowly whisk in olive oil. Add garlic cloves and set aside to steep."}, {"number": 3, "instructions": "Working in batches, cut the kale into thin ribbons: gather a large handful of leaves, bunch together tightly, and use the other hand to slice into 1/4-inch-thick pieces. This need not be done very precisely or neatly; the idea is to end up with a kind of slaw. (Recipe can be made up to this point 1 day ahead. Keep kale and dressing refrigerated separately.)"}, {"number": 4, "instructions": "Place chopped kale in a very large bowl. Sprinkle surface with almonds and then with cheese, if using. Remove and discard garlic cloves from dressing. Pour half the dressing over the salad and toss. Taste for dressing and salt and add more as needed, tossing to coat thoroughly. Serve within 1 hour."}], "photo_url": "http://graphics8.nytimes.com/images/2014/04/09/dining/lemonkale/lemonkale-articleLarge.jpg"}, {"name": "\n      Stuffing Muffins\n    ", "tags": [{"name": "Vegan"}, {"name": "Vegetarian"}], "preparation_time": "1 hour 15 minutes", "description": "Stuffing is a traditional Thanksgiving accompaniment to the turkey, but turning stuffing into muffins helps them hold their own on the holiday table -- with or without the bird.", "ingredients": [{"comment": "", "name": "bread cubes (about 1 loaf)", "unit": "cups ", "quantity": "8"}, {"comment": "", "name": "vegan butter", "unit": "tablespoons ", "quantity": "3"}, {"comment": "", "name": "medium onion, diced", "unit": "", "quantity": "1"}, {"comment": "", "name": "cloves garlic, minced", "unit": "", "quantity": "4"}, {"comment": "", "name": "celery, diced", "unit": "½ cups ", "quantity": "1"}, {"comment": "", "name": "ground flax seed", "unit": "tablespoon ", "quantity": "1"}, {"comment": "", "name": "thyme", "unit": "teaspoon ", "quantity": "1"}, {"comment": "", "name": "rosemary", "unit": "teaspoon ", "quantity": "1"}, {"comment": "", "name": "salt and pepper to taste", "unit": "", "quantity": ""}, {"comment": "", "name": "vegetable broth", "unit": "2½ - 3 cups ", "quantity": ""}, {"comment": "", "name": "oil to grease muffin tin", "unit": "", "quantity": ""}], "yield": "12-18 Mini muffins (depending on pan)", "steps": [{"number": 1, "instructions": "Preheat oven to 375 degrees. Spread bread cubes out on baking sheet in an even layer. Bake until toasted (about 10 to 15 minutes). Transfer bread to large bowl."}, {"number": 2, "instructions": "Heat the vegan butter in a skillet over medium heat. Once the butter has melted, add the onion, garlic and celery. Cook, stirring often, until the vegetables are very soft, about 10 minutes. Add mixture to bowl with bread cubes."}, {"number": 3, "instructions": "Stir together the ground flax seed and 3 tablespoons warm water in a small bowl. Let sit for 5 minutes to bloom and then add to the bowl with the bread. Add thyme, rosemary, salt and pepper into bowl with bread. Add the vegetable broth, one cup at a time, and toss together. Allow to absorb for a minute before adding more broth. If the bread is too soggy, do not add the full amount."}, {"number": 4, "instructions": "Lightly grease the mini muffin tin. Spoon mixture into each spot, packing it down and filling it slightly above the top. Bake for 18 to 20 minutes, until edges are browned. Remove from oven and let sit until cool enough to handle."}], "photo_url": "http://graphics8.nytimes.com/images/2015/11/10/science/wellstuffing/wellstuffing-articleLarge.jpg"}, {"name": "\n      Eggplant Walnut Ricotta Rolls With Fresh Greens and Basil Salad  \n    ", "tags": [{"name": "Vegetarian"}], "preparation_time": "40 minutes", "description": "If you're looking to wow your crowd this Thanksgiving, consider these festive eggplant rolls. Courtesy of reader Christine Vartanian Datian of Las Vegas, these decadent rolls of Japanese eggplant strips, ricotta and walnuts are colorful and tasty, with an added crunch.", "ingredients": [{"comment": "", "name": "Japanese eggplants, sliced lengthwise in 1/2-inch slices", "unit": "", "quantity": "6"}, {"comment": "", "name": "Kosher salt", "unit": "", "quantity": ""}, {"comment": "", "name": "ricotta cheese", "unit": "cups ", "quantity": "1 ½"}, {"comment": "", "name": "finely ground walnuts, (about 1 cup whole walnuts ground in a food processor)", "unit": "cup ", "quantity": "½"}, {"comment": "", "name": "cloves garlic, finely grated or chopped", "unit": "", "quantity": "2"}, {"comment": "", "name": "olive oil", "unit": "2-3 tablespoons ", "quantity": ""}, {"comment": "", "name": "dried dill", "unit": "teaspoon ", "quantity": "1"}, {"comment": "", "name": "sea salt", "unit": "teaspoon ", "quantity": "½"}, {"comment": "", "name": "nutmeg", "unit": "teaspoon ", "quantity": "½"}, {"comment": "", "name": "Juice and zest from 1 lemon", "unit": "", "quantity": ""}, {"comment": "", "name": "Canola oil", "unit": "", "quantity": ""}, {"comment": "", "name": "mixed salad greens", "unit": "8-10 cups ", "quantity": ""}, {"comment": "", "name": "extra virgin olive oil", "unit": "tablespoons ", "quantity": "3"}, {"comment": "", "name": "balsamic vinegar", "unit": "tablespoon ", "quantity": "1"}, {"comment": "", "name": "candied walnuts", "unit": "¼ cup ", "quantity": ""}, {"comment": "", "name": "handful basil", "unit": "", "quantity": "1"}], "yield": "4 servings", "steps": [{"number": 1, "instructions": "Wash eggplants, cut off and discard stems. On a cutting board, using a mandoline or sharp knife, slice each eggplant lengthwise in long pieces, 1/2-inch thick. Sprinkle eggplant slices with Kosher salt and place in a large colander to drain for 15 to 20 minutes. Discard liquid."}, {"number": 2, "instructions": "In a medium bowl, combine the ricotta cheese, walnuts, garlic, olive oil, dill, sea salt, nutmeg, lemon juice and lemon zest. Mix all ingredients until smooth in texture and set aside. (Ricotta filling should be chilled until ready to use.)"}, {"number": 3, "instructions": "In a large deep skillet, pour ½-inch canola oil and heat over medium heat until oil is hot. Blot the pieces of eggplant with paper towel to remove any water droplets and fry eggplant slices in batches until golden brown on both sides, about 90 seconds per side. Remove from pan to drain flat on paper towels."}, {"number": 4, "instructions": "Place slices of eggplant on a tray or dish and spread a tablespoon or two of the ricotta filling across each slice; roll up pin-wheel style and repeat until all eggplant slices have been filled and rolled."}, {"number": 5, "instructions": "In a medium bowl, toss the salad greens with olive oil and balsamic vinegar. Arrange the mixed greens on four serving plates and serve with eggplant walnut ricotta rolls. Toss torn basil leaves over the salad. Garnish salad with candied walnuts."}], "photo_url": "http://graphics8.nytimes.com/images/2015/11/06/science/welleggplant/welleggplant-articleLarge.jpg"}, {"name": "\n      Parsnip Gratin With Turmeric and Cumin\n    ", "tags": [{"name": "Feta"}, {"name": "Heavy Cream"}, {"name": "Parsnip"}], "preparation_time": "1 hour", "description": "Parsnips are underappreciated but are by far the tastiest of winter vegetables, sweet and deep-flavored. Here, they are parboiled and splashed with cream, then baked with an unlikely but delicious combination: turmeric, cumin and feta.", "ingredients": [{"comment": "", "name": "parsnips", "unit": "pounds ", "quantity": "3"}, {"comment": "", "name": "Salt and pepper", "unit": "", "quantity": ""}, {"comment": ", for greasing dish", "name": "butter", "unit": "tablespoons ", "quantity": "2"}, {"comment": "", "name": "heavy cream", "unit": "cups ", "quantity": "2"}, {"comment": "", "name": "turmeric", "unit": "½ teaspoon ", "quantity": ""}, {"comment": "", "name": "cumin", "unit": "½ teaspoon toasted and ground ", "quantity": ""}, {"comment": "", "name": "cayenne", "unit": "Pinch of ", "quantity": ""}, {"comment": ", crumbled", "name": "feta cheese", "unit": "ounces ", "quantity": "4"}], "yield": "4 to 6 servings", "steps": [{"number": 1, "instructions": "Bring a large pot of salted water to a boil. Peel parsnips and quarter lengthwise. With a paring knife, remove and discard hard central core. Cut parsnips into 3-inch batons. Parboil for 2 minutes, then drain and spread out on a baking sheet to cool briefly."}, {"number": 2, "instructions": "Butter a 9-by-12-inch shallow earthenware baking dish. Arrange parsnips in dish in one layer. Heat oven to 400 degrees."}, {"number": 3, "instructions": "Whisk together cream, turmeric and cumin. Season with salt and pepper and add a small pinch of cayenne."}, {"number": 4, "instructions": "Pour cream mixture over parsnips and sprinkle with feta. Bake for about 30 minutes, until bubbling and nicely browned."}], "photo_url": "http://graphics8.nytimes.com/images/2015/11/04/dining/04KITCHEN1/04KITCHEN1-articleLarge.jpg"}, {"name": "\n      Edna Lewis’s Spiced Pears\n    ", "tags": [{"name": "Pear"}, {"name": "Southern"}], "preparation_time": "Yield2 1/2 pounds pears, plus about 2 cups syrup", "description": "These sweet, sour and aromatic pears are terrific served with ice cream or yogurt, or they can be canned for preserving after cooking. Edna Lewis calls for Seckel pears, but this recipe works for Bosc or other varieties that will keep their shape when cooked. If you have to substitute, try to find smaller fruit, and halve them lengthwise if needed to fit in the pan. The leftover syrup is delicious in drinks.", "ingredients": [{"comment": "", "name": "cloves", "unit": "teaspoon ", "quantity": "1"}, {"comment": "", "name": "dark brown sugar", "unit": "pounds ", "quantity": "1 ½"}, {"comment": "", "name": "vinegar", "unit": "cups ", "quantity": "1 ½"}, {"comment": "", "name": "salt", "unit": "Pinch of ", "quantity": ""}, {"comment": "", "name": "pears", "unit": "pounds ", "quantity": "2 ½"}], "yield": "2 1/2 pounds pears, plus about 2 cups syrup", "steps": [{"number": 1, "instructions": "In a large saucepan over medium heat, toast the cloves, shaking the pan, until they’re very aromatic. Add the sugar, vinegar and salt, and bring up to a simmer. Simmer for 5 minutes."}, {"number": 2, "instructions": "Meanwhile, peel the pears, and halve them lengthwise, if needed, to fit the pan. (You can pick out the seeds if you like.) Carefully place the pears in the syrup, and simmer gently."}, {"number": 3, "instructions": "Stir the pears every few minutes, to make sure they cook evenly, especially if the hot syrup doesn’t completely submerge them. Cook them until they are just tender at their thickest parts; check with a toothpick after 15 minutes of cooking. When the pears are ready, remove the pan from the heat and place a clean plate on top of the pears to keep them submerged in the vinegar syrup. Allow to cool for six hours or overnight."}, {"number": 4, "instructions": "Serve right away, store in the refrigerator or can. If you store them in the fridge, you can separate the pears and syrup and use them independently. If you plan on canning, Lewis instructs you to strain the syrup and boil it for 5 minutes. Pack the pears in jars, cover with the hot syrup and process according to your jar manufacturer’s directions."}], "photo_url": "http://graphics8.nytimes.com/images/2015/11/01/magazine/01spicedpears/01spicedpears-articleLarge.jpg"}, {"name": "\n      Edna Lewis’s Corn Muffins\n    ", "tags": [{"name": "Buttermilk"}, {"name": "Corn Flour"}, {"name": "Lard"}, {"name": "Southern"}], "preparation_time": "35 minutes", "description": "After reading that Edna Lewis preferred extra-fine cornmeal, I adapted her recipe to use corn flour. (Be sure to get corn flour, not pure white cornstarch.) These muffins have great corn flavor, and they have a very tender, creamy texture when hot and stay moist when cool. If you’re using regular cornmeal, the muffins are still delicious, especially warm; just reduce the buttermilk to 2 cups.", "ingredients": [{"comment": " or butter, plus 2 tablespoons melted butter", "name": "lard", "unit": "tablespoons ", "quantity": "2"}, {"comment": " or extra-fine cornmeal (not cornstarch)", "name": "corn flour", "unit": "cups ", "quantity": "2 ½"}, {"comment": "", "name": "salt", "unit": "teaspoon ", "quantity": "1"}, {"comment": "", "name": "baking soda", "unit": "teaspoon ", "quantity": "1"}, {"comment": " (see note)", "name": "homemade baking powder", "unit": "teaspoon ", "quantity": "½"}, {"comment": ", room temperature", "name": "buttermilk", "unit": "cups ", "quantity": "2 ½"}, {"comment": "", "name": "beaten", "unit": "egg, ", "quantity": "1"}], "yield": "12 muffins", "steps": [{"number": 1, "instructions": "Preheat oven to 400. Generously grease the wells of the muffin pan with 2 tablespoons of lard or butter, leaving the extra fat in the wells. In a mixing bowl, sift together the corn flour, salt, baking soda and baking powder."}, {"number": 2, "instructions": "When the oven is hot, place the muffin tin inside to preheat. Meanwhile, stir the buttermilk into the dry ingredients and mix well, then stir in the egg and 2 tablespoons melted butter. When the muffin pan is very hot (if using butter to grease, the butter should have just stopped sizzling), carefully remove it, and quickly fill each well with about 3 ounces of batter. Bake for 17-20 minutes, rotating once, until a toothpick comes out clean and the edges of the muffins are golden brown."}, {"number": 3, "instructions": "Let the pan cool for 2 minutes on a rack, then remove the muffins. (If necessary, use a paring knife to release them.) Serve muffins hot, with butter."}], "photo_url": "http://graphics8.nytimes.com/images/2015/11/01/magazine/01cornmuffins/01cornmuffins-articleLarge.jpg"}, {"name": "\n      Edna Lewis’s Biscuits\n    ", "tags": [{"name": "Buttermilk"}, {"name": "Flour"}, {"name": "Lard"}, {"name": "Southern"}], "preparation_time": "Yield1 1/2 dozen", "description": "Edna Lewis mastered dozens of bread and biscuit recipes over the years, and in \"The Taste of Country Cooking,\" she offers two for biscuits; this is the flannel-soft version. Be sure to use homemade baking powder, which you can make easily by sifting together 2 parts cream of tartar with 1 part baking soda. It leaves no chemical or metallic taste.", "ingredients": [{"comment": "", "name": "sifted flour", "unit": "cups ", "quantity": "3"}, {"comment": "", "name": "salt", "unit": "scant teaspoon ", "quantity": "1"}, {"comment": "", "name": "baking soda", "unit": "teaspoon ", "quantity": "½"}, {"comment": "", "name": "Royal Baking Powder", "unit": "teaspoons ", "quantity": "4"}, {"comment": "", "name": "lard", "unit": "cup ", "quantity": "⅔"}, {"comment": " (If sweet milk is being used, omit the baking soda and the 2 tablespoons of milk; sweet milk is more liquid than sour and therefore these are not needed.)", "name": "plus 2 tablespoons buttermilk", "unit": "cup ", "quantity": "1"}], "yield": "1 1/2 dozen", "steps": [{"number": 1, "instructions": "Take a large bowl, sift into it the measured flour, salt, soda and baking powder. Add the lard, and blend together with a pastry blender or your fingertips until the mixture has the texture of cornmeal."}, {"number": 2, "instructions": "Add the milk all at once by scattering it over the dough. Stir vigorously with a stout wooden spoon. The dough will be very soft in the beginning but will stiffen in 2 or 3 minutes. Continue to stir a few minutes longer."}, {"number": 3, "instructions": "After the dough has stiffened, scrape from sides of bowl into a ball, and spoon onto a lightly floured surface for rolling. Dust over lightly with about a tablespoon of flour as the dough will be a bit sticky. Flatten the dough out gently with your hands into a thick, round cake, and knead for a minute by folding the outer edge of the dough into the center of the circle, giving a light knead as you fold the sides in overlapping each other."}, {"number": 4, "instructions": "Turn the folded side face down and dust lightly if needed, being careful not to use too much flour and cause the dough to become too stiff. Dust the rolling pin and the rolling surface well. Roll the dough out evenly to a 1/2-inch thickness or a bit less. Pierce the surface of the dough with a table fork. (It was said piercing the dough released the air while baking.)"}, {"number": 5, "instructions": "Dust the biscuit cutter in flour first; this will prevent the dough sticking to the cutter and ruining the shape of the biscuit. Dust the cutter as often as needed. An added feature to your light, tender biscuits will be their straight sides. This can be achieved by not wiggling the cutter. Press the cutter into the dough and lift up with a sharp quickness without a wiggle. Cut the biscuits very close together to avoid having big pieces of dough left in between each biscuit. Trying to piece together and rerolling leftover dough will change the texture of the biscuits."}, {"number": 6, "instructions": "Place the biscuits 1/2 inch or more apart on a heavy cookie sheet or baking pan, preferably one with a bright surface. The biscuits brown more beautifully on a bright, shining pan than on a dull one, and a thick bottom helps to keep them from browning too much on the bottom. Set to bake in a preheated 450-degree oven for 13 minutes. Remove from the oven, and let them rest for 3 to 4 minutes. Serve hot."}], "photo_url": "http://graphics8.nytimes.com/images/2015/11/01/magazine/01edna-lewis-southern-slide-RBRD/01edna-lewis-southern-slide-RBRD-articleLarge-v2.jpg"}, {"name": "\n      Spinach Spaetzle With Bacon and Sage\n    ", "tags": [{"name": "Bacon"}, {"name": "Egg"}, {"name": "Spinach"}, {"name": "German"}, {"name": "Austrian"}], "preparation_time": "1 hour", "description": "Spaetzle, the delicious little German dumplings (sometimes called batter noodles), are easy to make, though it takes a bit of practice. I prefer to form them with a soup spoon, flicking tiny half-moons of batter one-by-one into the pot, or to put the batter on a board and cut off thin strips of batter with a wet knife. Many cooks use a special spaetzle-making tool that forces squiggles of the batter into a pot of boiling water. Others push the batter through the holes of a colander, but for this you need to make a slightly wetter batter. These are green spaetzle, made with spinach purée, sizzled with bacon and sage leaves. (Instead of spinach, you could add chopped herbs, but plain spaetzle are divine, too.) Spaetzle take only moments to cook and can be prepared in advance, then sautéed in butter to serve.", "ingredients": [{"comment": " or equivalent quantity of larger leaves", "name": "baby spinach leaves", "unit": "ounces ", "quantity": "5"}, {"comment": "", "name": "eggs", "unit": "", "quantity": "4"}, {"comment": " yolks", "name": "egg", "unit": "", "quantity": "4"}, {"comment": "", "name": "Salt", "unit": "", "quantity": ""}, {"comment": "", "name": "nutmeg", "unit": "teaspoon grated ", "quantity": "¼"}, {"comment": "", "name": "black pepper", "unit": "teaspoon ", "quantity": "¼"}, {"comment": "", "name": "all-purpose flour", "unit": "cups ", "quantity": "3 ¼"}, {"comment": " or pancetta, cut crosswise into thin lardons", "name": "bacon", "unit": "ounces ", "quantity": "4"}, {"comment": "", "name": "butter", "unit": "tablespoons ", "quantity": "4"}, {"comment": "", "name": "sage leaves", "unit": "fresh ", "quantity": "12"}, {"comment": "", "name": "Parmesan", "unit": "Grated ", "quantity": ""}], "yield": "6 servings", "steps": [{"number": 1, "instructions": "Drop spinach leaves into boiling water to blanch, then transfer to a bowl of ice water to cool. Drain spinach and squeeze dry. Put cooked spinach in a blender or food processor with the eggs and yolks and blitz briefly to make a green purée. (Alternatively, finely chop the spinach and stir together with beaten eggs and yolks.)"}, {"number": 2, "instructions": "Put spinach in a mixing bowl or the bowl of a stand mixer. Add 1/2 teaspoon salt, the nutmeg and the pepper. Beat in flour and 3/4 cup cold water to make a wet, sticky batterlike dough. Beat for 5 minutes, until lump free. If the mixture seems too stiff, beat in a few more tablespoons cold water. (If using a spaetzle tool, thin the batter to a more runny consistency.) Leave batter to rest at room temperature, covered, for 15 minutes."}, {"number": 3, "instructions": "Prepare an ice-water bath. Bring a large wide pot of well-salted water to a boil. Stand close to the pot with the bowl of dough in one hand and a soup spoon in the other. With the edge of the spoon, grab thin slivers of dough approximately 1 inch long, dropping them one by one into the boiling water. (Cook a dozen or so at a time.) Let the spaetzle cook for 1 minute or so, until they rise to the surface. Remove with a skimmer and immediately cool in ice water. Continue until all batter is used. Drain cooked spaetzle and blot dry. (The recipe may be prepared up to this point several hours before serving.)"}, {"number": 4, "instructions": "Just before serving, set a large wide skillet over medium-high heat. Add bacon and let it render without browning much, about 2 minutes. Pour off fat and leave bacon in pan. Add butter and let it foam, then add sage leaves and let sizzle for 30 seconds. Add cooked spaetzle and sauté, stirring with a wooden spoon until heated through and lightly browned. Transfer to a warm serving bowl. Serve immediately with grated Parmesan."}], "photo_url": "http://graphics8.nytimes.com/images/2015/10/21/dining/21KITCHEN2/21KITCHEN2-articleLarge.jpg"}, {"name": "\n      Meera Sodha’s Naan\n    ", "tags": [{"name": "Flour"}, {"name": "Yogurt"}, {"name": "Indian"}], "preparation_time": "90 minutes", "description": "The British cookbook author learned this recipe from her aunt Harsha, and included it in her “Made in India: Recipes from an Indian Family Kitchen” in 2015. It is simple to make, and results in crackly-soft flatbreads singed by heat and yielding to tenderness within, with a faint tang of yogurt. It is exactly the sort of thing you’d love to dip in a pool of curry again and again. Just set up an assembly line to roll out the dough and cook it in a hot pan. Once you make the recipe two or three times you’ll never buy naan again.", "ingredients": [{"comment": ", or 500 grams", "name": "all-purpose flour", "unit": "cups ", "quantity": "4"}, {"comment": ", like canola, plus a teaspoon more", "name": "neutral oil", "unit": "tablespoons ", "quantity": "2"}, {"comment": "", "name": "whole-milk yogurt", "unit": "tablespoons ", "quantity": "4"}, {"comment": ", or 7 grams", "name": "dried yeast", "unit": "packet of active ", "quantity": "1"}, {"comment": "", "name": "sugar", "unit": "teaspoons ", "quantity": "2"}, {"comment": "", "name": "kosher salt", "unit": "teaspoons ", "quantity": "2"}, {"comment": "", "name": "baking powder", "unit": "level teaspoon ", "quantity": "1"}, {"comment": ", warmed", "name": "whole milk", "unit": "cup ", "quantity": "1"}], "yield": "4 to 6 servings", "steps": [{"number": 1, "instructions": "Put the flour into a large mixing bowl. Make a well in the middle, and add two tablespoons of the oil to it, along with the yogurt, yeast, sugar, salt and baking powder. Use your fingers to combine the ingredients until they resemble crumbs, and then add the warm milk in splashes, mixing until it comes together into a dough."}, {"number": 2, "instructions": "Put the dough on a clean, well-floured cutting board. It will be very sticky. Flour your hands, and knead the dough for five minutes or so, then scrape off your hands and knead it again, making it into a round ball. Rub a teaspoon of oil over the exterior of the dough, and place it in a clean mixing bowl. Cover with a dish towel, and place in a warm spot to rise for 60 to 90 minutes, or until it has doubled in size."}, {"number": 3, "instructions": "Using a knife, divide the dough into 12 pieces. Take each piece, roll it into a ball and flatten it between your palms. Dust the dough with flour, and roll each piece out into an oval of about 5 by 8 inches."}, {"number": 4, "instructions": "Place a large sauté pan over medium-high heat, and allow it to get hot. When it is, cook one naan in it for 30 to 40 seconds on one side, or until it begins to bubble, then use a spatula to flip it over to cook the other side for about the same amount of time, checking regularly to make sure that it does not burn. Flip the naan one more time, and press on it lightly with your spatula for 10 to 15 seconds, then remove to a warm platter. Repeat with the rest of the dough. (Keep the finished naan in a low oven, or wrap in foil until ready to serve.)"}], "photo_url": "http://graphics8.nytimes.com/images/2015/10/18/magazine/18eat2/18mag-18eat-t_CA0-articleLarge.jpg"}, {"name": "\n      Buttermilk Biscuits\n    ", "tags": [{"name": "Buttermilk"}], "preparation_time": "30 minutes", "description": "These soft and tender biscuits are made with cultured butter, which is  made with cream that is cultured, or fermented, before it is churned. Cultured butter can be made at home, but it is becoming easier to find in supermarkets. It’s worth seeking out. Any true butter fanatic should try it at least once.", "ingredients": [{"comment": " (2 2/3 cups)", "name": "all-purpose flour", "unit": "grams ", "quantity": "335"}, {"comment": " (3/4 cup)", "name": "cake flour", "unit": "grams ", "quantity": "75"}, {"comment": " (2 teaspoons)", "name": "baking soda", "unit": "grams ", "quantity": "10"}, {"comment": " (1 teaspoon)", "name": "baking powder", "unit": "grams ", "quantity": "4"}, {"comment": " (2 teaspoons)", "name": "fine sea salt", "unit": "grams ", "quantity": "6"}, {"comment": " (1 1/2 tablespoons)", "name": "granulated sugar", "unit": "grams ", "quantity": "15"}, {"comment": ", chilled and cubed (1 cup)", "name": "cultured butter", "unit": "sticks salted, ", "quantity": "2"}, {"comment": ", chilled", "name": "buttermilk", "unit": "cups ", "quantity": "1 ½"}, {"comment": "", "name": "egg", "unit": "large ", "quantity": "1"}, {"comment": "", "name": "milk", "unit": "tablespoon ", "quantity": "1"}], "yield": "12 to 15 biscuits", "steps": [{"number": 1, "instructions": "Heat oven to 425 degrees. Line a baking sheet with parchment paper. "}, {"number": 2, "instructions": "In a large bowl, whisk together flours, baking powder, baking soda, salt and sugar."}, {"number": 3, "instructions": "Using a pastry cutter or fork, quickly cut butter into flour mixture until it forms pea-size crumbs and is uniformly mixed. (For flaky biscuits, you want the butter to remain cold.) Make a well in center of mixture and pour in buttermilk. Stir together until it just forms a moist, slightly tacky dough.\n"}, {"number": 4, "instructions": "Turn dough out onto a lightly floured surface. Knead 2 or 3 times, then pat out into a 3/4-inch-thick round. Using a 2-inch round cutter, cut the biscuits. Do not twist the cutter; doing so prevents proper rising. To prevent sticking, dip the cutter lightly in flour between biscuits. Also, do not reroll scraps, but pat them together and cut into rounds. Transfer biscuits to baking sheet.\n"}, {"number": 5, "instructions": "Whisk egg and milk together with a fork. Generously brush egg wash on top of each biscuit. Bake until brown, 15 minutes. Serve hot.\n"}], "photo_url": "http://graphics8.nytimes.com/images/2013/10/09/dining/09APPE3/09JPAPPE2-articleLarge.jpg"}, {"name": "\n      All-Purpose Biscuits\n    ", "tags": [{"name": "All Purpose Flour"}, {"name": "Milk"}, {"name": "Unsalted Butter"}, {"name": "Southern"}], "preparation_time": "15 minutes", "description": "Biscuits are what take us into the kitchen today to cook: fat, flaky mounds of quick bread, golden brown, with a significant crumb. Composed of flour, baking powder, fat and a liquid, then baked in a hot oven, they are an excellent sop for sorghum syrup, molasses or honey. They are marvelous layered with country ham or smothered in white sausage gravy, with eggs, with grits. Biscuits are easy to make.", "ingredients": [{"comment": ", plus more for dusting", "name": "all-purpose flour", "unit": "cups ", "quantity": "2"}, {"comment": "", "name": "baking powder", "unit": "tablespoons ", "quantity": "2"}, {"comment": "", "name": "sugar", "unit": "scant tablespoon ", "quantity": "1"}, {"comment": "", "name": "salt", "unit": "teaspoon ", "quantity": "1"}, {"comment": ", preferably European style", "name": "unsalted butter", "unit": "tablespoons cold, ", "quantity": "5"}, {"comment": "", "name": "whole milk", "unit": "cup ", "quantity": "1"}], "yield": "6 to 8 servings", "steps": [{"number": 1, "instructions": "Preheat oven to 425. Sift flour, baking powder, sugar and salt into a large mixing bowl. Transfer to a food processor. Cut butter into pats and add to flour, then pulse 5 or 6 times until the mixture resembles rough crumbs. (Alternatively, cut butter into flour in the mixing bowl using a fork or a pastry cutter.) Return dough to bowl, add milk and stir with a fork until it forms a rough ball."}, {"number": 2, "instructions": "Turn the dough out onto a well-floured surface and pat it down into a rough rectangle, about an inch thick. Fold it over and gently pat it down again. Repeat. Cover the dough loosely with a kitchen towel and allow it to rest for 30 minutes."}, {"number": 3, "instructions": "Gently pat out the dough some more, so that the rectangle is roughly 10 inches by 6 inches. Cut dough into biscuits using a floured glass or biscuit cutter. Do not twist cutter when cutting; this crimps the edges of the biscuit and impedes its rise."}, {"number": 4, "instructions": "Place biscuits on a cookie sheet and bake until golden brown, approximately 10 to 15 minutes."}], "photo_url": "http://graphics8.nytimes.com/images/2014/04/03/dining/All-Purpose-Biscuits/All-Purpose-Biscuits-articleLarge.jpg"}, {"name": "\n      Corpse Reviver No. 28\n    ", "tags": [{"name": "Cointreau"}, {"name": "Genever Gin"}, {"name": "Lillet Blanc"}], "preparation_time": "Yield1 drink", "description": "The bartender Mimi Burnham’s take on the Corpse Reviver makes use of some uncommon ingredients that are worth seeking out: a barrel-aged Genever (a particularly rich and flavorful Dutch gin) and Grand Liqueur de Sapins (a sweet, seductive liqueur made with pine buds). When she has time, Burnham cuts orange peel into the shapes of tiny men and sets them to float, or drown, in the drink; I wholeheartedly endorse this garnish.", "ingredients": [{"comment": "", "name": "Boomsma Oude Fine Old Genever", "unit": "oz. ", "quantity": "¾"}, {"comment": "", "name": "Cointreau", "unit": "oz. ", "quantity": "¾"}, {"comment": "", "name": "Lillet Blanc", "unit": "oz. ", "quantity": "¾"}, {"comment": "", "name": "lemon juice", "unit": "oz. fresh ", "quantity": "½"}, {"comment": "", "name": "lime juice", "unit": "oz. fresh ", "quantity": "¼"}, {"comment": "", "name": "Grande Liqueur de Sapins", "unit": "Scant teaspoon of ", "quantity": ""}, {"comment": "", "name": "Orange twist", "unit": "", "quantity": ""}], "yield": "1 drink", "steps": [{"number": 1, "instructions": "Chill a coupe glass, and evenly coat inside with liqueur de sapin. Shake remaining ingredients with ice. Strain into coupe. Express the orange twist over the cocktail and drop it in."}], "photo_url": "http://graphics8.nytimes.com/images/2015/10/11/magazine/11drink-crop3/11mag-11drink-t_CA0-articleLarge.jpg"}]